In [40]:
import pandas as pd

In [41]:
df = pd.read_csv("supershops.csv")
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [42]:
x = df.drop('Profit', axis=1)
y = df['Profit']

In [43]:
y.head()

0    192261.83
1    191792.06
2    191050.39
3    182901.99
4    166187.94
Name: Profit, dtype: float64

In [44]:
x.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

In [45]:
x2 = x.copy()

In [46]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0        114523.61       136897.80  471784.10    Dhaka
1        162597.70       151377.59  443898.53      Ctg
2        153441.51       101145.55  407934.54  Rangpur
3        144372.41       118671.85  383199.62    Dhaka
4        142107.34        91391.77  366168.42  Rangpur

# Normalization

In [47]:
from sklearn.preprocessing import MinMaxScaler

In [48]:
m = MinMaxScaler()

In [49]:
numeric_columns = x2.select_dtypes(include=['float64', 'int64']).columns

for column in numeric_columns:
    x2[column] = m.fit_transform(x2[[column]])

In [50]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# Standardization

In [51]:
from sklearn.preprocessing import StandardScaler

In [52]:
s = StandardScaler()

In [53]:
numeric_columns = x2.select_dtypes(include=['float64', 'int64']).columns

for column in numeric_columns:
    x2[column] = s.fit_transform(x2[[column]])

In [54]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

# Robust Scaler

In [55]:
from sklearn.preprocessing import RobustScaler

In [56]:
r = RobustScaler()

In [57]:
numeric_columns = x2.select_dtypes(include=['float64', 'int64']).columns

for column in numeric_columns:
    x2[column] = r.fit_transform(x2[[column]])

In [58]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur

# Max Absolute Scaler

In [59]:
from sklearn.preprocessing import MaxAbsScaler

In [60]:
m_a_s = MaxAbsScaler()

In [61]:
numeric_columns = x2.select_dtypes(include=['float64', 'int64']).columns

for column in numeric_columns:
    x2[column] = m_a_s.fit_transform(x2[[column]])

In [62]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.449332        0.198805   1.000000    Dhaka
1         0.970189        0.401556   0.891559      Ctg
2         0.870987       -0.301810   0.751702  Rangpur
3         0.772728       -0.056401   0.655513    Dhaka
4         0.748187       -0.438385   0.589283  Rangpur